#선생님별 담당 과목
subject={
    "길준영":"수학1","심영훈":"수학2","김명식":"수학3","양동규":"수학4",
    "김상태":"물리1","신다인":"물리2","배동일":"물리3",
    "나선주":"화학","정화정":"화학","김나영":"화학",
    "이나영":"컴과","김주성":"컴과","성제현":"컴과",
    "신민경":"생물","서여민":"생물","이슬":"생물",
    "백지연":"국어","오성렬":"국어","최경미":"국어",
    "공윤주":"영어","구지연":"영어"
}

#선생님 이의신청 위치(교무실)
teacher = { 
    "길준영": ("융합", 1), "심영훈": ("우암", 3), "김명식": ("우암", 3), "양동규": ("우암", 2),
    "김상태": ("예지", 3), "신다인": ("예지", 3), "배동일": ("예지", 2),
    "나선주": ("우암", 2), "정화정": ("창의", 2), "김나영": ("창의", 2),
    "이나영": ("창의", 1), "김주성": ("창의", 1), "성제현": ("창의", 1),
    "신민경": ("예지", 4), "서여민": ("예지", 4), "이슬": ("예지", 4),
    "백지연": ("우암", 4), "오성렬": ("우암", 2), "최경미": ("예지", 2),
    "공윤주": ("융합", 2), "구지연": ("융합", 2) 
}

#수업 위치(융과탐, 과제연구, 창체는 각자가 달라 예지 2층으로 잡음)
place_sub={"융과탐":("예지",2),"과제":("예지",2),"물리":("예지",3),"체육":("예지",2),"생물":("예지",4),"수학":("우암",3),"미술":("우암",1),
           "국어":("우암",4),"영어":("융합",3),"화학":("창의",2),"영어회화":("융합",2),"공강":("예지",2),"컴과":("창의",1),"창체":("예지",2)}

#과목별 반마다 이의제기 가능 선생님
subject_teacher={
    "수학1":[0]+[{"길준영"} for i in range(8)],"수학2":[0]+[{"심영훈"} for i in range(8)],"수학3":[0]+[{"김명식"} for i in range(8)],"수학4":[0]+[{"양동규"} for i in range(8)],
    "물리1":[0]+[{"김상태"} for i in range(8)],"물리2":[0]+[{"신다인"} for i in range(8)],"물리3":[0]+[{"배동일"} for i in range(8)],
    "화학":[0]+[{"나선주"},{"나선주"},{"나선주"},{"정화정"},{"정화정"},{"정화정"},{"김나영"},{"김나영"}],
    "컴과":[0]+[{"이나영","김주성","성제현"} for i in range(8)],
    "생물":[0]+[{"신민경","서여민","이슬"} for i in range(8)],
    "국어":[0]+[{"백지연"},{"백지연"},{"백지연"},{"오성렬"},{"오성렬"},{"최경미"},{"최경미"},{"최경미"}],
    "영어":[0]+[{"공윤주","구지연"} for i in range(8)]
}

#과목별 반마다 수업 선생님
class_teacher={
    "화학":[0,"나선주","나선주","나선주","정화정","정화정","정화정","김나영","김나영"],
    "컴과":[0,"성제현","성제현","성제현","김주성","김주성","이나영","이나영","이나영"],
    "생물":[0,"이슬","이슬","이슬","신민경","신민경","신민경","신민경","서여민"],
    "국어":[0,"백지연","백지연","백지연","오성렬","오성렬","최경미","최경미","최경미"],
    "영어":[0,"구지연","구지연","구지연","구지연","공윤주","공윤주","공윤주","공윤주"]
}

#이의제기 배정 시간
time_slot = {
    1: "08:15~08:18", 2: "08:18~08:21", 3: "08:21~08:24", 4: "08:24~08:27", 5: "08:27~08:30",
    7: "09:20~09:23", 8: "09:23~09:26", 9: "09:26~09:29",
    11: "10:20~10:23", 12: "10:23~10:26", 13: "10:26~10:29",
    15: "11:20~11:23", 16: "11:23~11:26", 17: "11:26~11:29",
    19: "12:20~12:23", 20: "12:23~12:26", 21: "12:26~12:29",
    22: "12:29~12:32", 23: "12:32~12:35", 24: "12:35~12:38",
    25: "12:38~12:41", 26: "12:41~12:44", 27: "12:44~12:47",
    28: "12:47~12:50", 29: "12:50~12:53", 30: "12:53~12:56",
    31: "12:56~12:59", 32: "12:59~13:02", 33: "13:02~13:05",
    34: "13:05~13:08", 35: "13:08~13:11", 36: "13:11~13:14",
    37: "13:14~13:17", 38: "13:17~13:20",
    40: "14:10~14:13", 41: "14:13~14:16", 42: "14:16~14:19",
    44: "15:10~15:13", 45: "15:13~15:16", 46: "15:16~15:19"
}  #15~34 점심

#반마다 시간표
tt = [0,[
    ["융과탐", "융과탐", "국어",   "체육", "수학", "수학", "화학"],   # 월요일
    ["국어",   "국어",   "물리",   "물리", "영어", "영어", "융과탐"], # 화요일
    ["화학",   "화학",   "영어회화", "미술", "과제", "과제", "과제"], # 수요일
    ["수학",   "수학",   "공강",   "컴과", "생물", "생물", "영어"],   # 목요일
    ["컴과",   "컴과",   "물리",   "물리", "생물", "창체", "창체"]    # 금요일
],[
    ["물리",   "물리",   "컴과",   "컴과",   "수학",   "수학",   "국어"],     # 월
    ["융과탐", "융과탐", "영어",   "영어",   "체육",   "공강",   "화학"],     # 화
    ["국어",   "국어",   "물리",   "물리",   "과제",   "과제",   "과제"],     # 수
    ["수학",   "수학",   "미술",   "생물",   "영어회화", "화학",   "화학"],   # 목
    ["생물",   "생물",   "영어",   "컴과",   "융과탐", "창체",   "창체"]      # 금
],[
    ["화학",   "화학",   "영어", "영어", "물리", "물리", "생물"],         # 월요일
    ["수학",   "수학",   "컴과", "컴과", "생물", "생물", "영어회화"],     # 화요일
    ["융과탐", "융과탐", "수학", "수학", "과제", "과제", "과제"],     # 수요일
    ["미술", "국어", "컴과", "영어", "물리", "물리", "체육"],         # 목요일
    ["국어", "국어", "공강", "융과탐", "화학", "창체", "창체"]        # 금요일
],[
    ["물리", "물리", "화학", "화학", "국어", "국어", "융과탐"],     # 월
    ["수학", "수학", "생물", "생물", "컴과", "화학", "국어"],       # 화
    ["물리", "물리", "수학", "수학", "과제", "과제", "과제"],        # 수
    ["영어", "영어", "영어회화", "생물", "융과탐", "융과탐", "미술"], # 목
    ["컴과", "컴과", "공강", "영어", "체육", "창체", "창체"]         # 금
],[
    ["융과탐", "융과탐", "수학", "수학", "체육", "미술", "공강"],      # 월
    ["생물", "영어회화", "물리", "물리", "영어",   "컴과", "융과탐"],  # 화
    ["국어", "국어", "화학", "화학", "과제", "과제", "과제"],  # 수
    ["컴과", "컴과", "영어", "영어", "수학", "수학", "국어"],      # 목
    ["물리", "물리", "생물", "생물", "화학", "창체", "창체"]       # 금
],[
    ["공강",   "영어회화",   "수학",   "수학",   "물리",   "물리",   "국어"],   # 월
    ["융과탐",   "융과탐",   "컴과",   "컴과",   "생물",   "영어",   "미술"],   # 화
    ["생물",     "생물",     "국어",   "국어",   "과제",   "과제",   "과제"],   # 수
    ["화학",     "화학",     "물리",   "물리",   "수학",   "수학",   "컴과"],   # 목
    ["영어",     "영어",     "화학",   "체육",   "융과탐", "창체",   "창체"]    # 금
],[
    ["생물",   "생물",   "컴과",   "컴과",   "영어",   "영어",   "영어회화"],  # 월
    ["물리",   "물리",   "화학",   "화학",   "수학",   "수학",   "컴과"],      # 화
    ["융과탐", "융과탐", "미술",   "체육",   "과제",   "과제",   "과제"],      # 수
    ["국어",   "국어",   "생물",   "공강",   "물리",   "물리",   "화학"],      # 목
    ["수학",   "수학",   "영어",   "융과탐", "국어",   "창체",   "창체"]       # 금
],[
    ["화학",     "화학",     "영어",     "영어",     "영어회화", "공강",   "융과탐"],  # 월
    ["국어",     "국어",     "영어",     "생물",     "수학",     "수학",   "화학"],    # 화
    ["물리",     "물리",     "컴과",     "컴과",     "과제",     "과제",   "과제"],    # 수
    ["체육",     "미술",     "생물",     "생물",     "융과탐",   "융과탐", "국어"],    # 목
    ["수학",     "수학",     "물리",     "물리",     "컴과",     "창체",   "창체"]     # 금
]]
#교시 시간(공강 배정)
tclass=["08:30~09:20","09:30~10:20","10:30~11:20","11:30~12:20","13:20~14:10","14:20~15:10","15:20~16:10"]

#사이 time_slot의 시간을 선정하기 위한 함수
def betweentime(a,b,c):
    return int(a.split(":")[0])<int(c.split(":")[0])<int(b.split(":")[0]) or\
        (a.split(":")[0]==c.split(":")[0] and int(a.split(":")[1])<=int(c.split(":")[1])) or\
        (b.split(":")[0]==c.split(":")[0] and int(c.split(":")[1])<=int(b.split(":")[1]))

#건물, 층에 따른 거리를 계산
def dist(frm,to):
    #한층: 0 3
    
    #우암(2):예지(3) 100 5
    #우암(2):창의(2) 170 12
    #우암(2):융합(2) 150 8
    #예지(1):창의(2) 70 1
    #예지(2):융합(2) 50 0
    #창의(1):융합(2) 50 1

    if frm[0]==to[0]:
        d= 7*3*abs(to[1]-frm[1])
    if (frm[0],to[0]) not in {("우암","예지"),("우암","창의"),("우암","융합"),("예지","창의"),("예지","융합"),("창의","융합")}:
        frm,to=to,frm
    if frm[0]=="우암":
        if to[0]=="예지":
            return 100+7*(5+3*abs(to[1]-3)+3*abs(frm[1]-2))
        if to[0]=="창의":
            return 1000 #d= 170+7*(12+3*abs(to[1]-2)+3*abs(frm[1]-2))
        if to[0]=="융합":
            return 1000 #d= 150+7*(8+3*abs(to[1]-2)+3*abs(frm[1]-2))
    if frm[0]=="예지":
        if to[0]=="창의":
            d= 70+7*(1+3*abs(to[1]-2)+3*abs(frm[1]-1))
        if to[0]=="융합":
            d= 50+7*(0+3*abs(to[1]-2)+3*abs(frm[1]-2))
    if frm[0]=="창의":
        if to[0]=="융합":
            d= 50+7*(1+3*abs(to[1]-2)+3*abs(frm[1]-1))
    return 1000 if d>107 else d